# -*- coding: utf-8 -*-
import pyodbc

conn = pyodbc.connect(DSN='SQL',UID='sa',pwd='5202020l')

Tokens = ["LHX123"]
Warning_List = []
DamageType_List = ['000111000','000112000','000113000','000121000','000122000','000123000','000124000','000131000','000132000',
                   '000133000','000141000','000142000','000143000','000214000','000213000','000212000','000211000','000222000',
                   '000221000','000231000','000232000','000233000','000241000','000242000','000243000','000244000','000245000']

_RoadType_ = {1:"沥青路", 0:"水泥路"}
_SurfaceLevel_ = {1:"高级", 2:"次高级", 3:"中级", 4:"低级"}
_RoadLevel_ = {1:"快速路", 2:"主干路", 3:"次干路", 4:"支路"}
_TranLevel_ = {1:"特轻", 2:"轻", 3:"中", 4:"重", 5:"特重"}
_InnerType_ = {1:"柔性基层", 2:"半刚性基层", 3:"刚性基层", 4:"复合式基层"}
_ConservationLevel_ = {1:"1等养护道路", 2:"2等养护道路", 3:"3等养护道路"}

R_RoadType_ = {"沥青路":1, "水泥路":0}
R_SurfaceLevel_ = {"高级":1, "次高级":2, "中级":3, "低级":4}
R_RoadLevel_ = {"快速路":1, "主干路":2, "次干路":3, "支路":4}
R_TranLevel_ = {"特轻":1, "轻":2, "中":3, "重":4, "特重":5}
R_InnerType_ = {"柔性基层":1, "半刚性基层":2, "刚性基层":3, "复合式基层":4}
R_ConservationLevel_ = {"1等养护道路":1, "2等养护道路":2, "3等养护道路":3}

_DamageType_ = {
'沥青路裂缝类线裂':'000111000','沥青路裂缝类网裂':'000112000','沥青路裂缝类龟裂':'000113000',
'沥青路变形类拥包':'000121000','沥青路变形类车辙':'000122000','沥青路变形类沉陷':'000123000',
'沥青路变形类翻浆':'000124000','沥青路松散类剥落':'000131000','沥青路松散类坑槽':'000132000',
'沥青路松散类啃边':'000133000','沥青路其他类路框差':'000141000','沥青路其他类唧浆':'000142000',
'沥青路其他类泛油':'000143000','水泥路裂缝类交叉裂缝和破碎板':'000214000','水泥路裂缝类边角裂缝':'000213000',
'水泥路裂缝类板角断裂':'000212000','水泥路裂缝类线裂':'000211000','水泥路接缝破坏类边角剥落':'000222000',
'水泥路接缝破坏类接缝料损坏':'000221000','水泥路表面破坏类坑洞':'000231000','水泥路表面破坏类表面纹裂':'000232000',
'水泥路表面破坏类层状剥落':'000233000','水泥路其他类错台':'000241000','水泥路其他类拱胀':'000242000',
'水泥路其他类唧浆':'000243000','水泥路其他类路框差':'000244000','水泥路其他类沉陷':'000245000'}
R_DamageType_ = {
'000111000':'沥青路裂缝类线裂','000112000':'沥青路裂缝类网裂','000113000':'沥青路裂缝类龟裂',
'000121000':'沥青路变形类拥包','000122000':'沥青路变形类车辙','000123000':'沥青路变形类沉陷',
'000124000':'沥青路变形类翻浆','000131000':'沥青路松散类剥落','000132000':'沥青路松散类坑槽',
'000133000':'沥青路松散类啃边','000141000':'沥青路其他类路框差','000142000':'沥青路其他类唧浆',
'000143000':'沥青路其他类泛油','000214000':'水泥路裂缝类交叉裂缝和破碎板','000213000':'水泥路裂缝类边角裂缝',
'000212000':'水泥路裂缝类板角断裂','000211000':'水泥路裂缝类线裂','000222000':'水泥路接缝破坏类边角剥落',
'000221000':'水泥路接缝破坏类接缝料损坏','000231000':'水泥路表面破坏类坑洞','000232000':'水泥路表面破坏类表面纹裂',
'000233000':'水泥路表面破坏类层状剥落','000241000':'水泥路其他类错台','000242000':'水泥路其他类拱胀',
'000243000':'水泥路其他类唧浆','000244000':'水泥路其他类路框差','000245000':'水泥路其他类沉陷'}

Rank = {1:'A',2:'B',3:'C',4:'D'}
